/*********************************************************************************************************************
* TC264 Opensourec Library 锟斤拷锟斤拷TC264 锟斤拷源锟解）锟斤拷一锟斤拷锟斤拷锟节官凤拷 SDK 锟接口的碉拷锟斤拷锟斤拷锟斤拷源锟斤拷
* Copyright (c) 2022 SEEKFREE 锟斤拷煽萍锟�
*
* 锟斤拷锟侥硷拷锟斤拷 TC264 锟斤拷源锟斤拷锟揭伙拷锟斤拷锟�
*
* TC264 锟斤拷源锟斤拷 锟斤拷锟斤拷锟斤拷锟斤拷
* 锟斤拷锟斤拷锟皆革拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟结发锟斤拷锟斤拷 GPL锟斤拷GNU General Public License锟斤拷锟斤拷 GNU通锟矫癸拷锟斤拷锟斤拷锟街わ拷锟斤拷锟斤拷锟斤拷锟�
* 锟斤拷 GPL 锟侥碉拷3锟芥（锟斤拷 GPL3.0锟斤拷锟斤拷锟斤拷选锟斤拷模锟斤拷魏魏锟斤拷锟斤拷陌姹撅拷锟斤拷锟斤拷路锟斤拷锟斤拷锟�/锟斤拷锟睫革拷锟斤拷
*
* 锟斤拷锟斤拷源锟斤拷姆锟斤拷锟斤拷锟较ｏ拷锟斤拷锟斤拷芊锟斤拷锟斤拷锟斤拷茫锟斤拷锟斤拷锟轿达拷锟斤拷锟斤拷锟斤拷魏蔚谋锟街�
* 锟斤拷锟斤拷没锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟皆伙拷锟绞猴拷锟截讹拷锟斤拷途锟侥憋拷证
* 锟斤拷锟斤拷细锟斤拷锟斤拷渭锟� GPL
*
* 锟斤拷应锟斤拷锟斤拷锟秸碉拷锟斤拷锟斤拷源锟斤拷锟酵憋拷盏锟揭伙拷锟� GPL 锟侥革拷锟斤拷
* 锟斤拷锟矫伙拷校锟斤拷锟斤拷锟斤拷<https://www.gnu.org/licenses/>
*
* 锟斤拷锟斤拷注锟斤拷锟斤拷
* 锟斤拷锟斤拷源锟斤拷使锟斤拷 GPL3.0 锟斤拷源锟斤拷锟街ば拷锟� 锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟轿拷锟斤拷陌姹�
* 锟斤拷锟斤拷锟斤拷锟接拷陌锟斤拷锟� libraries/doc 锟侥硷拷锟斤拷锟铰碉拷 GPL3_permission_statement.txt 锟侥硷拷锟斤拷
* 锟斤拷锟街わ拷锟斤拷锟斤拷锟� libraries 锟侥硷拷锟斤拷锟斤拷 锟斤拷锟斤拷锟侥硷拷锟斤拷锟铰碉拷 LICENSE 锟侥硷拷
* 锟斤拷迎锟斤拷位使锟矫诧拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷 锟斤拷锟睫革拷锟斤拷锟斤拷时锟斤拷锟诫保锟斤拷锟斤拷煽萍锟斤拷陌锟饺拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟�
*
* 锟侥硷拷锟斤拷锟斤拷          zf_device_key
* 锟斤拷司锟斤拷锟斤拷          锟缴讹拷锟斤拷煽萍锟斤拷锟斤拷薰锟剿�
* 锟芥本锟斤拷息          锟介看 libraries/doc 锟侥硷拷锟斤拷锟斤拷 version 锟侥硷拷 锟芥本说锟斤拷
* 锟斤拷锟斤拷锟斤拷锟斤拷          ADS v1.9.4
* 锟斤拷锟斤拷平台          TC264D
* 锟斤拷锟斤拷锟斤拷锟斤拷          https://seekfree.taobao.com/
*
* 锟睫改硷拷录
* 锟斤拷锟斤拷              锟斤拷锟斤拷                锟斤拷注
* 2022-09-15       pudding            first version
* 2023-04-28       pudding            锟斤拷锟斤拷锟斤拷锟斤拷注锟斤拷说锟斤拷
********************************************************************************************************************/
/*********************************************************************************************************************
* 锟斤拷锟竭讹拷锟藉：
*                   ------------------------------------
*                   模锟斤拷芙锟�            锟斤拷片锟斤拷锟杰斤拷
*                   // 一锟斤拷锟斤拷锟斤拷锟藉按锟斤拷锟斤拷应锟斤拷锟斤拷锟斤拷
*                   KEY1/S1             锟介看 zf_device_key.h 锟斤拷 KEY_LIST[0]
*                   KEY2/S2             锟介看 zf_device_key.h 锟斤拷 KEY_LIST[1]
*                   KEY3/S3             锟介看 zf_device_key.h 锟斤拷 KEY_LIST[2]
*                   KEY4/S4             锟介看 zf_device_key.h 锟斤拷 KEY_LIST[3]
*                   ------------------------------------
********************************************************************************************************************/

#ifndef _zf_device_key_h_
#define _zf_device_key_h_

#include "zf_common_debug.h"
#include "zf_driver_gpio.h"

//==================================================锟斤拷锟斤拷 锟斤拷锟斤拷 锟斤拷锟斤拷锟斤拷锟斤拷================================================
// 锟斤拷锟藉按锟斤拷锟斤拷锟斤拷 锟矫伙拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟睫革拷 默锟较讹拷锟斤拷锟侥革拷锟斤拷锟斤拷
// 锟斤拷锟藉按锟斤拷顺锟斤拷锟接︼拷路锟� key_index_enum 枚锟斤拷锟斤拷锟叫讹拷锟斤拷锟剿筹拷锟�
// 锟斤拷锟斤拷没锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟� 锟斤拷么锟斤拷要同锟斤拷锟斤拷锟铰凤拷 key_index_enum 枚锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷
#define KEY_LIST                    {P20_12,P20_11,P20_7,P20_6,P20_2,P21_7}

#define KEY_RELEASE_LEVEL           (GPIO_HIGH)                                 // 锟斤拷锟斤拷锟斤拷默锟斤拷状态 也锟斤拷锟角帮拷锟斤拷锟酵凤拷状态锟侥碉拷平
#define KEY_MAX_SHOCK_PERIOD        (10       )                                 // 锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟绞憋拷锟� 锟斤拷位锟斤拷锟斤拷 锟斤拷锟斤拷锟斤拷锟绞憋拷锟斤拷锟斤拷藕呕岜伙拷锟轿拷锟斤拷硬锟斤拷锟斤拷锟�
#define KEY_LONG_PRESS_PERIOD       (1000     )                                 // 锟斤拷小锟斤拷锟斤拷时锟斤拷 锟斤拷位锟斤拷锟斤拷 锟斤拷锟斤拷锟斤拷锟绞憋拷锟斤拷锟斤拷藕呕岜伙拷锟轿拷浅锟斤拷锟斤拷锟斤拷锟�
//==================================================锟斤拷锟斤拷 锟斤拷锟斤拷 锟斤拷锟斤拷锟斤拷锟斤拷================================================


//==================================================锟斤拷锟斤拷 锟斤拷锟斤拷 锟斤拷锟斤拷锟结构锟斤拷===============================================
typedef enum
{
    KEY_1,
    KEY_2,
    KEY_3,
    KEY_4,
    KEY_5,
    KEY_6,
    KEY_NUMBER,
}key_index_enum;                                                                // 锟斤拷锟斤拷锟斤拷锟斤拷 锟斤拷应锟较凤拷锟斤拷锟斤拷陌锟斤拷锟斤拷锟斤拷鸥锟斤拷锟� 默锟较讹拷锟斤拷锟侥革拷锟斤拷锟斤拷

typedef enum
{
    KEY_RELEASE,                                                                // 锟斤拷锟斤拷锟酵凤拷状态
    KEY_SHORT_PRESS,                                                            // 锟斤拷锟斤拷锟教帮拷状态
    KEY_LONG_PRESS,                                                             // 锟斤拷锟斤拷锟斤拷锟斤拷状态
}key_state_enum;
//==================================================锟斤拷锟斤拷 锟斤拷锟斤拷 锟斤拷锟斤拷锟结构锟斤拷===============================================

extern key_state_enum       key_state[KEY_NUMBER];

//==================================================锟斤拷锟斤拷 锟斤拷锟斤拷 锟斤拷锟斤拷锟斤拷锟斤拷===============================================
void            key_scanner             (void);                                 // 锟斤拷锟斤拷状态扫锟斤拷
key_state_enum  key_get_state           (key_index_enum key_n);                 // 锟斤拷取锟斤拷锟斤拷状态
void            key_clear_state         (key_index_enum key_n);                 // 锟斤拷锟街革拷锟斤拷锟斤拷锟阶刺�
void            key_clear_all_state     (void);                                 // 锟斤拷锟斤拷锟斤拷邪锟斤拷锟阶刺�
void            key_init                (uint32 period);                        // 锟斤拷锟斤拷锟斤拷始锟斤拷
uint8           key_switch(void);
//==================================================锟斤拷锟斤拷 锟斤拷锟斤拷 锟斤拷锟斤拷锟斤拷锟斤拷===============================================

#endif
